from company import *


year = Class(1)
first_topic = Topic('Счет предметов. Сравнение групп предметов. Пространственные и временные представления.')
lvl_11 = Level(1, info='Привет! Посчитай количество предметов на картинке и ответь на вопрос.')
lvl_11.add(Task(text='Сколько здесь желтых яблок?', image='pic/1.jpg', answer='4'))
lvl_11.add(Task(text='А сколько здесь всего яблок?', image='pic/1.jpg', answer='9'))
lvl_11.add(Task(text='Сколько же здесь грибов?', image='pic/2.jpg', answer='8'))
lvl_11.add(Task(text='А здесь сколько девочек?', image='pic/3.jpg', answer='4'))

lvl_21 = Level(1, info='Ты отлично справляешься! Смотри какие красивые пчелы!')
lvl_21.add(Task(text='Сколько здесь пчелок?', image='pic/4.jpg', answer='6'))
lvl_21.add(Task(text='А сколько у одной пчелки крылышек?', image='pic/4.jpg', answer='2'))
lvl_21.add(Task(text='Сколько же у них всего крыльев?', image='pic/4.jpg', answer='12'))
lvl_21.add(Task(text='А сколько на этой картинке цветов?', image='pic/4.jpg', answer='3'))

lvl_31 = Level(1, info='Быстро ты! Давай сравнивать группы.')
lvl_31.add(Task(text='Где предметов больше: слева и справа?', image='pic/5.jpg', answer='Слева', choice=['Слева', 'Справа']))
lvl_31.add(Task(text='Каких мишек больше?', image='pic/6.jpg', answer='Бурых', choice=['Бурых', 'Белых']))
lvl_31.add(Task(text='Чего больше: шляп или конфет?', image='pic/7.jpg', answer='Конфет', choice=['Шляп', 'Конфет', "Поровну"]))
lvl_31.add(Task(text='Чего больше: снежинок или лягушек?', image='pic/7.jpg', answer='Поровну', choice=['Лягушек', 'Снежинок', "Поровну"]))

lvl_41 = Level(1, info='Добро пожаловать! Продолжим наше занятие')
lvl_41.add(Task(text='Свеклы больше, меньше или равно?', image='pic/8.jpg', answer='Равно', choice=['Больше', 'Меньше', 'Равно']))
lvl_41.add(Task(text='Морковки больше, меньше или равно?', image='pic/9.jpg', answer='Равно', choice=['Больше', 'Меньше', 'Равно']))
lvl_41.add(Task(text='Лука больше, меньше или равно?', image='pic/10.jpg', answer='Больше', choice=['Больше', 'Меньше', 'Равно']))
lvl_41.add(Task(text='Желудей больше, меньше или равно по сравнению с клубникой?', image='11.jpg', answer='Меньше', choice=['Больше', 'Меньше', 'Равно']))

lvl_51 = Level(1, info='Отлично, а теперь блиц')
lvl_51.add(Task(text='Кто больше: волк или жук?', answer='Волк', choice=['Волк', 'Жук', 'Похожие по размеру']))
lvl_51.add(Task(text='А что выше: светофор или дом?', answer='Дом', choice=['Дом', 'Светофор', 'Похожие по размеру']))
lvl_51.add(Task(text='Кто умнее: филин или кабан?', answer='Филин', choice=['Кабан', 'Филин', 'Похожие по уму']))

lvl_61 = Level(1, info='Уже неплохо получается! Давай займемся пространством')
lvl_61.add(Task(text='Как мальчику дойти до школы?', image='pic/12.jpg', answer='Пойти направо', choice=['Пойти направо', 'Пойти налево', 'Пойти вперёд']))
lvl_61.add(Task(text='А как дойти до кинотеатра?', image='pic/12.jpg', answer='Пойти налево', choice=['Пойти направо', 'Пойти налево', 'Пойти вперёд']))
lvl_61.add(Task(text='Сколько цветов справа от мальчика?', image='pic/12.jpg', answer='2'))
lvl_61.add(Task(text='А сколько слева от мальчика?', image='pic/12.jpg', answer='3'))

lvl_71 = Level(1, info='Посмотри какой красивый зайчик!')
lvl_71.add(Task(text='Что он сделал первым делом?', image='pic/13.jpg', answer='Проснулся', choice=['Поел', 'Проснулся', 'Сделал зарядку', "Пошёл в школу"]))
lvl_71.add(Task(text='Что он сделал потом?', image='pic/13.jpg', answer='Сделал зарядку', choice=['Поел', 'Проснулся', 'Сделал зарядку', "Пошёл в школу"]))
lvl_71.add(Task(text='Какое было его последнее действие?', image='pic/13.jpg', answer='Пойти в школу', choice=['Поесть', 'Проснуться', 'Сделать зарядку', "Пойти в школу"]))
lvl_71.add(Task(text='А всего было действий?', image='pic/13.jpg', answer='5'))

lvl_81 = Level(1, info='Все знают сказку про колобка!')
lvl_81.add(Task(text='Кого он встретил первым?', answer='Бабушку с дедушкой', choice=['Лису', 'Бабушку с дедушкой', 'Волка', "Зайца"]))
lvl_81.add(Task(text='А потом он с кем встретился?', answer='С зайцем', choice=['С лисой', 'С медведем', 'Волка', "Зайца"]))
lvl_81.add(Task(text='На ком же закончился его путь?', answer='Лиса', choice=['Лиса', 'Бабушка с дедушкой', 'Волк', "Медведь"]))
lvl_81.add(Task(text='А кто был самым маленьким героем этой сказки?', answer='Колобок', choice=['Лиса', 'Колобок', 'Заяц', "Медведь"]))

lvl_91 = Level(1, info='Рассмотрим картинку')
lvl_91.add(Task(text='В первом случае яблоко лежит', image='pic/14.jpg', answer='Перед стулом', choice=['Под стулом', 'Около стула', 'За стулом', "Перед стулом"]))
lvl_91.add(Task(text='А на третьей картинке яблоко лежит', image='pic/14.jpg', answer='Около стула', choice=['Под стулом', 'Около стула', 'За стулом', "На стуле"]))
lvl_91.add(Task(text='А на пятой картинке где оно лежит?', image='pic/14.jpg', answer='Под стулом', choice=['Под стулом', 'Около стула', 'За стулом', "На стуле"]))

lvl_101 = Level(1, info='Рассмотрим картинку', style='test', time=60, topic='Счет предметов. Сравнение групп предметов. Пространственные и временные представления.')
lvl_101.add(Task(text='Сколько на картинке зонтиков?', answer='4', image='pic/16.jpg'))
lvl_101.add(Task(text='А батонов тут сколько?', answer='6', image='pic/16.jpg'))
lvl_101.add(Task(text='Хорошо, а чего больше: карандашей или снежинок?', answer='Снежинок', image='pic/16.jpg', choice=['Снежинок', 'Карандашей', 'Поровну']))
lvl_101.add(Task(text='А что больше по размеру: дом или зонтик?', answer='Дом', image='pic/16.jpg', choice=['Дом', 'Зонтик', 'Похожие']))
lvl_101.add(Task(text='Рассмотрим новую картинку. Где дети старше?', answer='Снежинок', image='pic/15.jpg', choice=['Слева', 'По краям', 'В центре']))
lvl_101.add(Task(text='Кто выше: мальчик в кепке или девочка с каре?', answer='Мальчик', image='pic/15.jpg', choice=['Девочка', 'Мальчик', 'Одного роста']))
lvl_101.add(Task(text='А у кого из них самые длинные брюки?', answer='Он слева от мальчика в кепке', image='pic/15.jpg', choice=['Он стоит крайним', 'Он стоит справа от мальчика в кепке', 'Он слева от мальчика в кепке', "У нее хвостик", "Он носит кепку"]))
lvl_101.add(Task(text='А у кого из девочек самая коротка стрижка?', answer='Она крайняя', image='pic/15.jpg', choice=['Она по центру', 'Она крайняя', 'Справа от нее стоит девочка', "Слева от нее мальчик"]))


# тема 2
second_topic = Topic('Понятия «много», «один», «длиннее», «короче», «одинаковые по длине».')

lvl_12 = Level(1, info='Определи размер предметов и ответь на вопросы')
lvl_12.add(Task(text='Какая палочка самая длинная?', image='pic/18.jpg', answer='3', choice=['1', '2', '3']))
lvl_12.add(Task(text='Какая морковка самая короткая?', image='pic/18.jpg', answer='1', choice=['1', '2', '3']))

lvl_22 = Level(1, info="Определи на каком месте?")
lvl_22.add(Task(text="На каом месте четвертая по размеру гусиница?", image='pic/21.jpg', answer='3', choice=['1', '2', '3', '4', '5']))

lvl_32 = Level(1, info='какой предмет толще ?')
lvl_32.add(Task(text="какой ствол толще?", image='pic/22.jpg', answer='левый', choice=['правый', 'лелый']))
lvl_32.add(Task(text="Какая морковка толще?", image="pic/23.jpg", answer='правая', choice=['правая', 'левая']))

lvl_32 = Level(1, info='одинаковые ли длинны?')
lvl_32.add(Task(text="Есть ли на картинке ленточки одинаковой длинны", image='pic/23.jpg', answer='да', choice=['нет', 'да']))
lvl_32.add(Task(text="Все ли линии одиноковые по длинне?", image="pic/25.jpg", answer='нет', choice=['да', 'нет']))



lvl_42 = Level(1, info='Рассмотрим картинку', style='test', time=60, topic='Сравнение предметов по форме(длинна толщина).')
lvl_42.add(Task(text="какая палочка самая длинная?", image='pic/25.jpg', answer='Крассная', choice=['зеланая', 'синяя', 'крассная']))
lvl_42.add(Task(text="А какая самая короткая ?", image="pic/25.jpg", answer='нет', choice=['зеланая', 'синяя', 'крассная']))
lvl_42.add(Task(text="Чего больше перцев или морковок?", image='pic/9.jpg', answer='Одинокого', choice=['морковок', 'перцев', 'одинакого']))
lvl_42.add(Task(text="Какая палочка между длинной и короткой", image="pic/18.jpg", answer='2', choice=['2', '3', '1']))
lvl_42.add(Task(text="под каким номером самая кароткая гусеница?", image='pic/21.jpg', answer='2'))
lvl_42.add(Task(text="Есть ли на картинке предметы одиниковой длинны?", image="pic/17.jpg", answer='да', choice=['нет', 'да']))

# тема 3
third_topic = Topic('Знаки «+», «-». Состав числа 5 из двухслагаемых.')

lvl_13 = Level(1, info='Знаки «+», «-»')
lvl_13.add(Task(text='какой знак нужно поставить?', image='pic/26.jpg', answer='-', choice=['-', '+']))
lvl_13.add(Task(text='Выберите знак + или -', image='pic/27.jpg', answer='+', choice=['+', '-']))
lvl_13.add(Task(text='+ или -', image='pic/28.jpg', answer='+', choice=['-', '+']))
lvl_13.add(Task(text='Выберите знак', image='pic/29.jpg', answer='-', choice=['+', '-']))
lvl_13.add(Task(text='Ну и последний раз', image='pic/30.jpg', answer='+', choice=['+', '-']))

lvl_23 = Level(1, info='Состав числа 5 из двухслагаемых.')
lvl_13.add(Task(text='Какую цифру нужно постаивть?', image='pic/31.jpg', answer='2'))
lvl_13.add(Task(text='Что нужно поставить ?', image='pic/32.jpg', answer='1'))
lvl_13.add(Task(text='', image='pic/33.jpg', answer='1'))
lvl_13.add(Task(text='Ну и последний раз', image='pic/34.jpg', answer='5'))