from company import *
from compani import *


year = Class(1)
first_topic = Topic('Счет предметов. Сравнение групп предметов. Пространственные и временные представления.')
lvl_1 = Level(1, info='Привет! Посчитай количество предметов на картинке и ответь на вопрос.')
lvl_1.add(Task(text='Сколько здесь желтых яблок?', image='1.jpg', answer='4'))
lvl_1.add(Task(text='А сколько здесь всего яблок?', image='1.jpg', answer='9'))
lvl_1.add(Task(text='Сколько же здесь грибов?', image='2.jpg', answer='8'))
lvl_1.add(Task(text='А здесь сколько девочек?', image='3.jpg', answer='4'))

lvl_2 = Level(1, info='Ты отлично справляешься! Смотри какие красивые пчелы!')
lvl_2.add(Task(text='Сколько здесь пчелок?', image='4.jpg', answer='6'))
lvl_2.add(Task(text='А сколько у одной пчелки крылышек?', image='4.jpg', answer='2'))
lvl_2.add(Task(text='Сколько же у них всего крыльев?', image='4.jpg', answer='12'))
lvl_2.add(Task(text='А сколько на этой картинке цветов?', image='4.jpg', answer='3'))

lvl_3 = Level(1, info='Быстро ты! Давай сравнивать группы.')
lvl_3.add(Task(text='Где предметов больше: слева и справа?', image='5.jpg', answer='Слева', choice=['Слева', 'Справа']))
lvl_3.add(Task(text='Каких мишек больше?', image='6.jpg', answer='Бурых', choice=['Бурых', 'Белых']))
lvl_3.add(Task(text='Чего больше: шляп или конфет?', image='7.jpg', answer='Конфет', choice=['Шляп', 'Конфет', "Поровну"]))
lvl_3.add(Task(text='Чего больше: снежинок или лягушек?', image='7.jpg', answer='Поровну', choice=['Лягушек', 'Снежинок', "Поровну"]))

lvl_4 = Level(1, info='Добро пожаловать! Продолжим наше занятие')
lvl_4.add(Task(text='Свеклы больше, меньше или равно?', image='8.jpg', answer='Равно', choice=['Больше', 'Меньше', 'Равно']))
lvl_4.add(Task(text='Морковки больше, меньше или равно?', image='9.jpg', answer='Равно', choice=['Больше', 'Меньше', 'Равно']))
lvl_4.add(Task(text='Лука больше, меньше или равно?', image='10.jpg', answer='Больше', choice=['Больше', 'Меньше', 'Равно']))
lvl_4.add(Task(text='Желудей больше, меньше или равно по сравнению с клубникой?', image='11.jpg', answer='Меньше', choice=['Больше', 'Меньше', 'Равно']))

lvl_5 = Level(1, info='Отлично, а теперь блиц')
lvl_5.add(Task(text='Кто больше: волк или жук?', answer='Волк', choice=['Волк', 'Жук', 'Похожие по размеру']))
lvl_5.add(Task(text='А что выше: светофор или дом?', answer='Дом', choice=['Дом', 'Светофор', 'Похожие по размеру']))
lvl_5.add(Task(text='Кто умнее: филин или кабан?', answer='Филин', choice=['Кабан', 'Филин', 'Похожие по уму']))

lvl_6 = Level(1, info='Уже неплохо получается! Давай займемся пространством')
lvl_6.add(Task(text='Как мальчику дойти до школы?', image='12.jpg', answer='Пойти направо', choice=['Пойти направо', 'Пойти налево', 'Пойти вперёд']))
lvl_6.add(Task(text='А как дойти до кинотеатра?', image='12.jpg', answer='Пойти налево', choice=['Пойти направо', 'Пойти налево', 'Пойти вперёд']))
lvl_6.add(Task(text='Сколько цветов справа от мальчика?', image='12.jpg', answer='2'))
lvl_6.add(Task(text='А сколько слева от мальчика?', image='12.jpg', answer='3'))

lvl_7 = Level(1, info='Посмотри какой красивый зайчик!')
lvl_7.add(Task(text='Что он сделал первым делом?', image='13.jpg', answer='Проснулся', choice=['Поел', 'Проснулся', 'Сделал зарядку', "Пошёл в школу"]))
lvl_7.add(Task(text='Что он сделал потом?', image='13.jpg', answer='Сделал зарядку', choice=['Поел', 'Проснулся', 'Сделал зарядку', "Пошёл в школу"]))
lvl_7.add(Task(text='Какое было его последнее действие?', image='13.jpg', answer='Пойти в школу', choice=['Поесть', 'Проснуться', 'Сделать зарядку', "Пойти в школу"]))
lvl_7.add(Task(text='А всего было действий?', image='13.jpg', answer='5'))

lvl_8 = Level(1, info='Все знают сказку про колобка!')
lvl_8.add(Task(text='Кого он встретил первым?', answer='Бабушку с дедушкой', choice=['Лису', 'Бабушку с дедушкой', 'Волка', "Зайца"]))
lvl_8.add(Task(text='А потом он с кем встретился?', answer='С зайцем', choice=['С лисой', 'С медведем', 'Волка', "Зайца"]))
lvl_8.add(Task(text='На ком же закончился его путь?', answer='Лиса', choice=['Лиса', 'Бабушка с дедушкой', 'Волк', "Медведь"]))
lvl_8.add(Task(text='А кто был самым маленьким героем этой сказки?', answer='Колобок', choice=['Лиса', 'Колобок', 'Заяц', "Медведь"]))

lvl_9 = Level(1, info='Рассмотрим картинку')
lvl_9.add(Task(text='В первом случае яблоко лежит', image='14.jpg', answer='Перед стулом', choice=['Под стулом', 'Около стула', 'За стулом', "Перед стулом"]))
lvl_9.add(Task(text='А на третьей картинке яблоко лежит', image='14.jpg', answer='Около стула', choice=['Под стулом', 'Около стула', 'За стулом', "На стуле"]))
lvl_9.add(Task(text='А на пятой картинке где оно лежит?', image='14.jpg', answer='Под стулом', choice=['Под стулом', 'Около стула', 'За стулом', "На стуле"]))

lvl_10 = Level(1, info='Рассмотрим картинку', style='test', time=60, topic='Счет предметов. Сравнение групп предметов. Пространственные и временные представления.')
lvl_10.add(Task(text='Сколько на картинке зонтиков?', answer='4', image='16.jpg'))
lvl_10.add(Task(text='А батонов тут сколько?', answer='6', image='16.jpg'))
lvl_10.add(Task(text='Хорошо, а чего больше: карандашей или снежинок?', answer='Снежинок', image='16.jpg', choice=['Снежинок', 'Карандашей', 'Поровну']))
lvl_10.add(Task(text='А что больше по размеру: дом или зонтик?', answer='Дом', image='16.jpg', choice=['Дом', 'Зонтик', 'Похожие']))
lvl_10.add(Task(text='Рассмотрим новую картинку. Где дети старше?', answer='Снежинок', image='15.jpg', choice=['Слева', 'По краям', 'В центре']))
lvl_10.add(Task(text='Кто выше: мальчик в кепке или девочка с каре?', answer='Мальчик', image='15.jpg', choice=['Девочка', 'Мальчик', 'Одного роста']))
lvl_10.add(Task(text='А у кого из них самые длинные брюки?', answer='Он слева от мальчика в кепке', image='15.jpg', choice=['Он стоит крайним', 'Он стоит справа от мальчика в кепке', 'Он слева от мальчика в кепке', "У нее хвостик", "Он носит кепку"]))
lvl_10.add(Task(text='А у кого из девочек самая коротка стрижка?', answer='Она крайняя', image='15.jpg', choice=['Она по центру', 'Она крайняя', 'Справа от нее стоит девочка', "Слева от нее мальчик"]))



