classes = [1, 2, 3, 4]
topics = [["Счет предметов", "Многоугольники", "Задачки на увеличение", "Задачки на уменьшение", "Задачки (разнобой)",
           "Примеры на счет"],
          ["Числа от 1 до 20", "Счет десятками", "Сложение и вычитание (Числа от 1 до 100)", "Уравнения",
           "Деление и умножение (Начальные)", "Примеры"],
          ["Сложение (Трехзначные числа)", "Вычитание (Трехзначные числа)", "Деление (Среднее)", "Умножение (Среднее)",
           "Деление (Трехзначные числа)", "Примеры (Трехзначные числа)"],
          ["Сложение (Три слагаемых)", "Сложение (Числа больше 1000)", "Умножение (На произведение)",
           "Умножение (Продвинутое)", "Деление (На двузначные)", "Деление (Продвинутое)"]]
